Repository: kaechele/gluon
Catalog: docs/locales/*/LC_MESSAGES/features/autoupdater.po
Languages: de

source: Gluon contains an automatic update system which can be configured in the site configuration.
de: Gluon enthält ein automatisches Updatesystem, welches in der Site-Konfiguration angepasst werden kann.

source: Building Images
de: Images bauen

source: By default, the autoupdater is disabled (as it is usually not helpful to have unexpected updates during development), but it can be enabled by setting the variable GLUON_BRANCH when building to override the default branch set in the site configuration.
de: Standardmäßig ist der Autoupdater deaktiviert, da es bei der Entwicklung ungünstig ist, wenn unerwartet Updates installiert werden. Er kann jedoch durch das Setzen der Variable GLUON_BRANCH während des Bauprozesses aktiviert werden um den in der Site-Konfiguration vorgegebenen Wert zu überschreiben.

source: A manifest file for the updater can be generated with `make manifest`. A signing script (using ``ecdsautils``) can be found in the `contrib` directory. When creating the manifest, the ``PRIORITY`` value may be defined by setting ``GLUON_PRIORITY`` on the command line or in ``site.mk``.
de: Eine Manifest-Datei für den Updater kann durch `make manifest` generiert werden. Ein Signierungsskript (verwendet ``ecdsautils``) ist im Ordner `contrib` zu finden. Bei der Erzeugung kann die ``PRIORITY``-Einstellung durch das Setzen der Variable ``GLUON_PRIORITY`` auf der Kommandozeile oder in der ``site.mk`` definiert werden.

source: ``GLUON_PRIORITY`` defines the maximum number of days that may pass between releasing an update and installation of the images. The update probability will start at 0 after the release time declared in the manifest file by the variable DATE and then slowly rise up to 1 when ``GLUON_PRIORITY`` days have passed. The autoupdater checks for updates hourly (at a random minute of the hour), but usually only updates during its run between 4am and 5am, except when the whole ``GLUON_PRIORITY`` days and another 24 hours have passed.
de: ``GLUON_PRIORITY`` definiert die maximale Anzahl an Tagen, die zwischen Veröffentlichung und der Installation eines Updates vergehen dürfen. Die Updatewahrscheinlichkeit (probability) hat zum im Manifest in der Variable DATE definierten Zeitpunk den Wert 0 und steigt dann langsam auf 1 bis ``GLUON_PRIORITY`` Tage verstrichen sind. Der Autoupdater prüft stündlich (zu einer zufälligen Minute) auf neue Updates, installiert diese aber für gewöhnlich nur in der Zeit zwischen 4 Uhr und 5 Uhr morgens. Wurde ``GLUON_PRIORITY`` bereits um mindestens 24 Stunden überschritten wird das Update unverzüglich installiert.

source: ``GLUON_PRIORITY`` may be an integer or a decimal fraction.
de: ``GLUON_PRIORITY`` Kann eine Ganzzahl oder Dezimalzahl sein.

source: If ``GLUON_RELEASE`` is passed to ``make`` explicitly or it is generated dynamically in ``site.mk``, care must be taken to pass the same ``GLUON_RELEASE`` to ``make manifest``, as otherwise the generated manifest will be incomplete.
de: Wenn ``GLUON_RELEASE`` explizit beim ``make`` gesetzt ist oder dynamisch durch die Angabe in der``site.mk`` generiert wird, muss zwingend derselbe ``GLUON_RELEASE`` an ``make manifest`` übergeben werden, da sonst das generierte Manifest unvollständig bleibt.

source: Automated nightly builds
de: Automatisierte nächtliche Builds

source: A fully automated nightly build could use the following commands:
de: Ein vollständig automatisierter, nächtlicher Build könnte die folgenden Kommandos verwenden:

source: Infrastructure
de: Infrastruktur

source: We suggest to have following directory tree accessible via http:
de: Es wird empfohlen die folgende Verzeichnisstruktur per HTTP bereitzuhalten:

source: The server must be available via IPv6.
de: Der Server muss per IPv6 erreichbar sein.

source: Command Line
de: Kommandozeile

source: These commands can be used on a node:
de: Diese Befehle können auf Knoten verwendet werden:
