Repository: kaechele/gluon
Catalog: docs/locales/*/LC_MESSAGES/dev/wan.po
Languages: de

source: WAN support
de: WAN-Unterstützung

source: As the WAN port of a node will be connected to a user's private network, it is essential that the node only uses the WAN when it is absolutely necessary. There are two cases in which the WAN port is used:
de: Da der WAN-Anschluss eines Knotens in der Regel mit dem privaten Netzwerk des Nutzers verbunden ist muss sichergestellt sein, dass die WAN Verbindung nur dann verwendet wird, wenn es unbedingt notwendig ist. Für zwei Dienste wird die WAN-Verbindung aktuell genutzt:

source: Mesh VPN (package ``gluon-mesh-vpn-fastd``)
de: Mesh VPN (Paket ``gluon-mesh-vpn-fastd``)

source: DNS to resolve the VPN servers' addresses (package ``gluon-wan-dnsmasq``)
de: DNS zur Auflösung der VPN-Server Adressen (Paket ``gluon-wan-dnsmasq``)

source: After the VPN connection has been established, the node should be able to reach the mesh's DNS servers and use these for all other name resolution.
de: Nachdem die VPN Verbindung hergestellt wurde sollte der Knoten in der Lage sein die DNS Server im Mesh zu erreichen und diese im Weiteren zur Namensauflösung zu nutzen.

source: Routing tables
de: Routingtabellen

source: As a node may get IPv6 default routes both over the WAN and the mesh, Gluon uses two routing tables for IPv6. As all normal traffic should go over the mesh, the mesh routes are added to the default table (table 0). All routes on the WAN interface are put into table 1 (see ``/lib/gluon/upgrade/110-network`` in ``gluon-core``).
de: Da ein Knoten Defaultrouten für IPv6 sowohl über die WAN-Schnittstelle als auch über das Mesh erhalten kann nutzt Gluon zwei Routingtabellen für IPv6. Da jeglicher regulärer Datenverkehr über das Mesh laufen sollte, werden die Defaultrouten aus dem Mesh in die Default-Routingtabelle (Tabelle 0) eingefügt. Alle Routen auf der WAN-Schnittstelle werden in Tabelle 1 eingefügt (siehe auch ``/lib/gluon/upgrade/110-network`` in ``gluon-core``).

source: There is also an *ip -6 rule* which routes all IPv6 traffic with a packet mark with the bit 1 set though table 1.
de: Ferner existiert eine *ip -6 rule*, die allen Traffic, der das Bit 1 gesetzt hat, über Routen aus der Tabelle 1 lenkt.

source: *libpacketmark* is a library which can be loaded with ``LD_PRELOAD`` and will set the packet mark of all sockets created by a process in accordance with the ``LIBPACKETMARK_MARK`` environment variable. This allows setting the packet mark for processes which don't support this themselves. The process must run as root (or at least with ``CAP_NET_ADMIN``) for this to work.
de: *libpacketmark* ist eine Bibliothek, die mittels ``LD_PRELOAD`` geladen werden kann und alle Paketmarker für Sockets des betroffenen Prozesses gemäß der Umgebungsvariable ``LIBPACKETMARK_MARK`` setzt. Dies ermöglicht das setzen eines Paketmarkers für Anwendungen, die dies nicht nativ unterstützen. Der Prozess muss als root (oder zumindest mit ``CAP_NET_ADMIN``) laufen, damit dies funktioniert.

source: Unfortunately there's no nice way to set the packet mark via iptables for outgoing packets. The iptables will run after the packet has been created, to even when the packet mark is changed and the packet is re-routed, the source address won't be rewritten to the default source address of the newly chosen route. *libpacketmark* avoids this issue as the packet mark will already be set when the packet is created.
de: Leider gibt es keinen eleganten Weg eine Paketmarkierung mittels IPTables für ausgehende Pakete zu setzen. Die IPTables Regel schlägt erst an nachdem das Paket erzeugt wurde, somit wird die Absenderadresse trotz der gesetzten Paketmarkierung und umleitung des Paketes nicht auf die Standard-Quelladresse für die neugewählte Route umgeschrieben. *libpacketmark* umgeht dieses Problem indem es die Paketmarkierung bei der Erzeugung des Paketes setzt.

source: To separate the DNS servers in the mesh from the ones on the WAN, the ``gluon-wan-dnsmasq`` package provides a secondary DNS daemon which runs on ``127.0.0.1:54``. It will automatically use all DNS servers explicitly configured in ``/etc/config/gluon-wan-dnsmasq`` or received via DNS/RA on the WAN port. It is important that no DNS servers for the WAN interface are configured in ``/etc/config/network`` and that ``peerdns`` is set to 0 so the WAN DNS servers aren't leaked to the primary DNS daemon.
de: Um die DNS-Server auf dem WAN Interface von denen im Mesh zu trennen offeriert das Paket ``gluon-wan-dnsmasq`` einen sekundären DNS-Server welcher unter ``127.0.0.1:54`` erreichbar ist. Dieser DNS-Server nutzt automatisch alle DNS-Server, die explizit in ``/etc/config/gluon-wan-dnsmasq`` konfiguriert werden oder per DHCP/RA auf dem WAN-Anschluss empfangen werden. Es wichtig darauf zu achten, dass keine DNS-Server für den WAN-Anschluss in ``/etc/config/network`` konfiguriert ist und dass ``peerdns`` auf 0 gesetzt ist, sodass die WAN DNS nicht gegenüber dem primären DNS bekannt werden.

source: *libpacketmark* is used to make the secondary DNS daemon send its requests over the WAN interface.
de: *libpacketmark* wird verwendet um die Anfragen des sekundären DNS-Server über den WAN-Anschluss zu senden.

source: The package ``gluon-mesh-vpn-fastd`` provides an iptables rule which will redirect all DNS requests from processes running with the primary group ``gluon-mesh-vpn`` to ``127.0.0.1:54``, thus making fastd use the secondary DNS daemon.
de: Das Paket ``gluon-mesh-vpn-fastd`` enthält eine IPTables Regel welche alle DNS-Anfragen von Prozessen, die unter der primären Gruppe ``gluon-mesh-vpn`` laufen, nach ``127.0.0.1:54`` umleitet und damit fastd zur Nutzung des sekundären DNS Servers zwingt.
