Repository: kaechele/gluon
Catalog: docs/locales/*/LC_MESSAGES/user/faq.po
Languages: de

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: What hardware is supported?
de: Welche Hardware wird unterstützt?

source: A table with hardware supported by Gluon can be found on the `OpenWrt Wiki`_. If you want to find out if your device can potentially be supported have a look at :doc:`../dev/hardware` for detailed hardware requirements.
de: Eine Tabelle mit Hardware, die von Gluon Unterstützt wird findet sich im `OpenWrt Wiki`_. Um herauszufinden ob für ein bestimmtes Gerät eine Unterstützung erfolgen kann empfiehlt sich ein Blick in :doc:`../dev/hardware` für detaillierte Angaben zu den Hardwareanforderungen.

source: Why does DNS not work on the nodes?
de: Warum funktioniert DNS auf den Knoten nicht?

source: Gluon nodes will ignore the DNS server on the WAN port for everything except the mesh VPN, which can lead to confusion.
de: Gluon-Knoten ignorieren den DNS-Server auf dem WAN-Anschluss für alles außer dem Verbindungsaufbau zum Mesh-VPN. Dies kann zu Verwirrung bei Nutzern führen.

source: All normal services on the nodes exclusively use the DNS server on the mesh interface. This DNS server must be announced in router advertisements (using *radvd* or a similar software) from one or more central servers in meshes based on *batman-adv*. If your mesh does not have global IPv6 connectivity, you can setup your *radvd* not to announce a default route by setting the *default lifetime* to 0; in this case, the *radvd* is only used to announce the DNS server.
de: Alle normalen Dienste auf dem Knoten verwenden ausschließlich die DNS-Server, die über das Mesh-Interface bereitgestellt werden. Dieser DNS-Server muss mittels Router Advertisements (z.B. durch *radvd*) von einem der zentraler positionierten Server im Mesh annonciert werden. Wenn das Mesh keine globale IPv6-Konnektivität hat kann *radvd* durch das setzen der *default lifetime* auf 0 so konfiguriert werden, dass keine Default Route annonciert wird. In diesem Fall wird der *radvd* dann nur verwendet um den DNS-Server zu annoncieren.

source: What is a good MTU on the mesh-vpn?
de: Welche MTU empfiehlt sich für das mesh-vpn?

source: Setting the MTU on the transport interface requires careful consideration, as setting it too low will cause excessive fragmentation and setting it too high may leave peers with a broken tunnel due to packet loss.
de: Die Auswahl einer MTU auf dem Transportinterface muss sorgsam erfolgen, da ein zu niedriger Wert unnötig starke Fragmentierung der Pakete hervorruft und ein zu hoher Wert zu Konnektivitätsproblemen aufgrund verworfener Pakete in manchen Konstellationen führen kann.

source: Consider these key values:
de: Folgende Elemente sollten bedacht werden:

source: Payload: Allow for the transport of IPv6 packets, by adhering to the minimum MTU of 1280 Byte specified in RFC 2460 - and configure `MSS clamping`_ accordingly, - and announce your link MTU via Router Advertisements and DHCP
de: Nutzlast: Eine minmale MTU von 1280 Bytes sollte gemäß RFC 2460 gewährleistet sein um den Transport von IPv6-Paketen zu ermöglichen. Hierzu sollte `MSS clamping`_ entsprechend konfiguriert sein und die Link-MTU per Router Advertisements und DHCP annonciert werden

source: Encapsulation: Account for the overhead created by the configured mesh protocol encapsulating the payload, which is - up to 32 Byte (14 Byte Ethernet + 18 Byte batadv) for batman-adv compat v15 (v2014.0 and later) - up to 28 Byte (14 Byte Ethernet + 14 Byte batadv) for batman-adv compat v14 (v2011.3.0 until and including v2013.4.0)
de: Verkapselung: Der Overhead für die Verkapselung der Nutzlast durch das konfigurierte Meshverfahren muss in die Berechnung einbezogen werden. Für batman-adv compat v15 (v2014.0 und neuer) beträgt dieser bis zu 32 Byte (14 Byte Ethernet + 18 Byte batadv) und für batman-adv compat v14 (v2011.3.0 bis einschließlich v2013.4.0) bis zu 28 Byte (14 Byte Ethernet + 14 Byte batadv)

source: PMTU: What MTU does the path between your gateway and each of its peers support?
de: PMTU: Was darf der MTU auf dem Pfad zwischen dem Gateway und jedem Knoten im Netzwerk maximal betragen?

source: For reference, the complete MTU stack looks like this:
de: Zur Veranschaulichung der MTU Berechnung kann dieses Diagramm herangezogen werden:

source: Minimum MTU
de: Minimale MTU

source: Calculate the minimum transport MTU by adding the encapsulation overhead to the minimum payload MTU required. This is the lowest recommended value, since going lower would cause unnecessary fragmentation for clients which respect the announced link MTU.
de: Die minimale MTU wird berechnet indem man den Overhead der Verkapselung mit der minimal notwendigen MTU addiert. Dies ist der niedrigste empfohlene Wert, da ein noch niedrigerer Wert unnötige Fragmentierung bei Clients erzeugt, die eine annoncierte MTU anwenden.

source: Example: Our network currently uses batman-adv v15, it therefore requires up to 32 Bytes of encapsulation overhead on top of the minimal link MTU required for transporting IPv6.::
de: Beispiel: Unser Netzwerk verwendet batman-adv v15. Daher benötigt es bis zu 32 Bytes Overhead bei der Verkapselung zusätzlich zur minimalen MTU, die zum Transport von IPv6-Paketen benötigt wird.::

source: Maximum MTU
de: Maximale MTU

source: Calculating the maximum transport MTU is interesting, because it increases the throughput, by allowing larger payloads to be transported, but also more difficult as you have to take into account the tunneling overhead and each peers PMTU, which varies between providers. The underlying reasons are mostly PPPoE, Tunneling and IPv6 transition technologies like DS-Lite.
de: Die Berechnung der maximalen MTU ist spannend, da sich der Datendurchsatz optimieren lässt wenn man mehr Nutzdaten in einem Paket transportieren kann. Sie ist aber auch nicht trivial, da der Overhead für das Tunnelprotokoll sowie die PMTU eines jeden Knotens, welche von Anbieter zu Anbieter unterschiedlich sein kann, betrachtet werden müssen. Einflussfaktoren sind hierbei häufig PPPoE, Tunnelprotokolle und IPv6-Übergangstechnologien wie DS-Lite.

source: Example: The peer with the smallest MTU on your network is behind DS-Lite and can transport IPv4 packets up to 1436 Bytes in size. Your tunnel uses IPv4 (20 Byte), UDP (8 Byte), Fastd (24 byte) and you require TAP (14 Byte) for Layer 2 (Ethernet) Tunneling.::
de: Beispiel: Der Knoten mit der kleinsten MTU im Netzwerk ist hinter einem DS-Lite Anschluss und kann IPv4-Pakete mit einer maximalen Länge von 1436 Byte transportieren. Das eingesetzte Tunnelprotokoll verwendet IPv4 (20 Byte), UDP (8 Byte), Fastd (24 Byte) und benötigt TAP (14 Byte) für Layer 2 (Ethernet) Tunneling.::

source: Conclusion
de: Fazit

source: Determining the maximum MTU can be a tedious process, especially since the PMTU of peers could change at any time. The general recommendation for maximized compatibility is therefore the minimum MTU of 1312 Byte, which works well with all combinations of IPv4, IPv6, batman-adv compat v14 and v15.
de: Die Bestimmung der maximalen MTU kann ein aufwändiger Prozess sein, insbesondere da sich die PMTU der teilnehmenden Knoten jederzeit und ohne Vorwarnung ändern kann. Die allgemeine Empfehlung für maximale Kompatibilität ist daher eine minimale MTU von 1312 Byte. Dieser Wert hat sich beim Einsatz verschiedenster Kombinationen von IPv4, IPv6, batman-adv compat v14 und v15 bewährt.
